app/controllers/lineups_controller.rb

SELECT  "player_lists".* FROM "player_lists" WHERE "player_lists"."player_list_id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
  def new
    @players_list= PlayerList.find_by(id: params[:players_list_id])