app/controllers/partidos_controller.rb

SELECT "partidos".* FROM "partidos"
---
  def index
    @partidos= Partido.all

SELECT  "partidos".* FROM "partidos" WHERE "partidos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "player_lists".* FROM "player_lists" WHERE "player_lists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @partido= Partido.find_by(id: params[:id])
    @playerslist = PlayerList.find_by(id: @partido.id)

INSERT INTO "partidos" ("created_at", "updated_at", "opponent", "date", "time") VALUES (?, ?, ?, ?, ?)  [["created_at", 2016-08-03 19:41:36 UTC], ["updated_at", 2016-08-03 19:41:36 UTC], ["opponent", "CEU"], ["date", Thu, 04 Aug 2016], ["time", 2000-01-01 15:00:00 UTC]]
---
  def create
    partido = Partido.new(opponent: params[:opponent],
                      date: params[:date],
                      time: params[:time])
   if partido.save

SELECT  "partidos".* FROM "partidos" WHERE "partidos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @partido = Partido.find_by(id: params[:id])

SELECT  "partidos".* FROM "partidos" WHERE "partidos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "partidos" SET "rival" = ?, "updated_at" = ? WHERE "partidos"."id" = ?  [["rival", "Gotics"], ["updated_at", 2016-07-29 16:38:32 UTC], ["id", 1]]
---
  def update
    partido = Partido.find_by(id: params[:id])
    partido.update(opponent: params[:opponent])