app/controllers/players_lists_controller.rb

  def new
    @partido = Partido.find(params[:partido_id])
    @playerlist = PlayerList.new
    @players = Player.all
---
SELECT  "partidos".* FROM "partidos" WHERE "partidos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "players".* FROM "players" ORDER BY "players"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def get_players_json
      @players = Player.all
---
SELECT "players".* FROM "players"

  def create
    my_partido = Partido.find_by(id: params[:partido_id])
    players_list = Player.where(id: [params[:idPlayers]])
---
SELECT  "partidos".* FROM "partidos" WHERE "partidos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "players".* FROM "players" WHERE "players"."id" IN (8, 7)

  def show
    @players = PlayerList.find_by(partido_id: params[:partido_id]).players
---
SELECT  "player_lists".* FROM "player_lists" WHERE "player_lists"."partido_id" = ? LIMIT ?  [["partido_id", 3], ["LIMIT", 1]]