app/controllers/players_controller.rb

  def show
    @player= Player.find_by(id: params[:id])
---
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create

    @player = current_user.players.build(player_params)

   if @player.save
---
INSERT INTO "players" ("created_at", "updated_at", "name", "lastname1", "lastname2", "position", "user_id", "avatar") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["created_at", 2016-08-02 17:52:55 UTC], ["updated_at", 2016-08-02 17:52:55 UTC], ["name", "a"], ["lastname1", "a"], ["lastname2", "a"], ["position", 2], ["user_id", 2], ["avatar", nil]]

  def edit
    @player = Player.find_by(id: params[:id])
---
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    @player = Player.find_by(id: params[:id])

    if @player.update(player_params)
---
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "players" SET "updated_at" = ?, "data_naixement" = ? WHERE "players"."id" = ?  [["updated_at", 2016-07-30 22:23:07 UTC], ["data_naixement", Thu, 18 Jun 1992], ["id", 6]]